CodeLands/nrs-projekt/stm32_modul/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "usb_device.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "usbd_cdc_if.h"
#include "stm32f3xx_hal.h"

#include <stdio.h>
#include <string.h>
#include <math.h>  // For fabsf and fmaxf
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define DEBUG 1

#ifdef DEBUG
#define LED_PIN_GYRO GPIO_PIN_11
#define LED_PIN_ACCEL GPIO_PIN_12
#define LED_PIN_MAGNET GPIO_PIN_13
#define LED_PIN_UART GPIO_PIN_14
#define LED_PIN_SEND_MODE GPIO_PIN_15

#define LED_PORT GPIOC
#endif

// Response Statuses
#define TIMEOUT 0
#define SUCCESS 1
#define ERROR 2
#define WAITING 3
#define IDLE 4
#define SEND_REQUEST 5

// Setup Stages
#define AT_TEST 0
#define AT_SET_CONNECT_MODE 1
#define AT_SET_MAX_CONNECTIONS 2
#define AT_START_SERVER 3
#define AT_SEND_HTML_HEADER 4
#define AT_SEND_HTML 5
#define AT_SEND_CONNECT_REQUEST 6

#define HEADER_MAG 0xAAAB
#define HEADER_ACC 0xBBBB
#define HEADER_GYR 0xCCCC
#define BUFFER_SIZE 64

#define ENABLE_MAGNETOMETER 1
#define ENABLE_ACCELEROMETER 1
#define ENABLE_GYROSCOPE 1

#define MODE_NONE 0
#define MODE_BINARY_UART 1
#define MODE_ASCII_UART 2
#define MODE_BINARY_CDC 3
#define MODE_ASCII_CDC 4

#define RX_BUFFER_SIZE 2048 * 4

//#define APP_RX_DATA_SIZE 2048
//#define APP_TX_DATA_SIZE 2048
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;

SPI_HandleTypeDef hspi1;

UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
volatile uint8_t data_ready_mag = 0;
volatile uint8_t data_ready_acc = 0;
volatile uint8_t data_ready_gyr = 0;
volatile uint16_t packet_number = 0;

volatile uint8_t transmission_mode = MODE_NONE;

volatile uint8_t rx_buffer[RX_BUFFER_SIZE];
volatile uint8_t last_buffer[RX_BUFFER_SIZE];
volatile uint16_t rx_index = 0;
//volatile uint8_t rx_data_ready = 0;

volatile uint32_t button_press_start = 0;
volatile uint8_t button_pressed = 0;
volatile uint8_t button_action_pending = 0;
volatile uint8_t button_action_type = 0; // 0 for short press, 1 for long press

volatile uint8_t setup_stage = AT_TEST;
volatile uint8_t response_status = IDLE;
volatile uint8_t has_response_changed = 0;
volatile uint32_t tick_when_sent = 0; // Added to track response timing

volatile uint8_t is_client_connected = 0;
volatile uint8_t was_client_connected = 0;

volatile uint8_t is_client_requesting_page = 0;
volatile uint8_t was_client_requesting_page = 0;

uint8_t connection_established = 0;

//#define RX_TIMEOUT_MS 1000 // Timeout for data reception in milliseconds

volatile uint32_t last_rx_tick = 0;  // Time of the last received byte
volatile uint8_t receiving_data = 0; // Flag to indicate ongoing reception

const char *html_page2 =
    "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\nContent-Length: 253\r\n\r\n<!DOCTYPE html><html><head><title>Wi-Fi Config</title></head><body><form method=\"GET\" action=\"/\" accept-charset=\"utf-8\">SSID: <input type=\"text\" name=\"ssid\"><br>Password: <input type=\"text\" name=\"password\"><br><input type=\"submit\" value=\"Submit\"></form></body></html>\r\n";

const char *html_page = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\nContent-Length: 45\r\n\r\n<html><body><h1>Hello, World!</h1></body></html>\r\n";
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_I2C1_Init(void);
static void MX_SPI1_Init(void);
static void MX_USART2_UART_Init(void);
/* USER CODE BEGIN PFP */
void Init_All_Sensors(void);
void Pack_Data(uint8_t *binary_buffer, uint16_t header, int16_t x, int16_t y, int16_t z);
void Transmit_Data_ASCII(const char *sensor_label, float x, float y, float z);
uint8_t CDC_Transmit_FS(uint8_t* Buf, uint16_t Len);
uint8_t Pisi_Register(uint8_t device, uint8_t reg, uint8_t value);
void Beri_Registre(uint8_t device, uint8_t reg, uint8_t* data, uint8_t length);
float Convert_To_Gauss(int16_t raw_value);
void Verify_Sensors(void);
void Clear_Interrupts(void);
void Send_Command(const char* cmd);
void Change_Response_Status(uint8_t new_status);
void Send_Data_To_Server(const char *json_data);

#if ENABLE_MAGNETOMETER
void Handle_Magnetometer(void);
#endif
#if ENABLE_ACCELEROMETER
void Handle_Accelerometer(void);
#endif
#if ENABLE_GYROSCOPE
void Handle_Gyroscope(void);
#endif
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* Sensor initialization */
void Init_All_Sensors(void) {
    #if ENABLE_MAGNETOMETER
    // Initialize magnetometer
    Pisi_Register(0x1E, 0x60, 0x8C);  // CFG_REG_A: Enable XYZ, 20 Hz
    Pisi_Register(0x1E, 0x61, 0x00);  // CFG_REG_B: ±50 gauss
    Pisi_Register(0x1E, 0x62, 0x01);  // CFG_REG_C: DRDY interrupt
    HAL_Delay(10);
    #endif

    #if ENABLE_ACCELEROMETER
	Pisi_Register(0x19, 0x20, 0x47); // CTRL_REG1_A: ODR=50Hz, enable XYZ
	Pisi_Register(0x19, 0x23, 0x18); // CTRL_REG4_A: Full-scale ±4g, High resolution
	Pisi_Register(0x19, 0x22, 0x10); // CTRL_REG3_A: Enable INT1 for data ready
	Pisi_Register(0x19, 0x30, 0x00); // INT1_CFG_A: OR combination of events

	HAL_Delay(10);
    #endif

    #if ENABLE_GYROSCOPE
    // Initialize gyroscope
    spi1_pisiRegister(0x20, 0x80);  // Soft reset
    HAL_Delay(100);
    spi1_pisiRegister(0x20, 0x7F);  // CTRL1: Enable XYZ, 200Hz
    spi1_pisiRegister(0x22, 0x08);  // CTRL3: Enable data ready on INT2
    spi1_pisiRegister(0x23, 0x10);  // CTRL4: ±500dps range
    HAL_Delay(10);
    #endif
}

/* Verify Sensor Communication */
void Verify_Sensors(void) {
    uint8_t who_am_i = 0;

    #if ENABLE_MAGNETOMETER
    Beri_Registre(0x1E, 0x4F, &who_am_i, 1); // Read WHO_AM_I register
    if (who_am_i != 0x6E) {
        CDC_Transmit_FS((uint8_t *)"Magnetometer communication failed\n", 34);
    } else {
        CDC_Transmit_FS((uint8_t *)"Magnetometer initialized\n", 25);
    }
    HAL_Delay(10);
    #endif

