CodeLands/nrs-projekt/stm32_modul/Core/Src/main.c
    #if ENABLE_ACCELEROMETER
    Beri_Registre(0x19, 0x0F, &who_am_i, 1); // Read WHO_AM_I register
    if (who_am_i != 0x33) {
        CDC_Transmit_FS((uint8_t *)"Accelerometer communication failed\n", 36);
    } else {
        CDC_Transmit_FS((uint8_t *)"Accelerometer initialized\n", 27);
    }
    HAL_Delay(10);
    #endif

    #if ENABLE_GYROSCOPE
    Beri_Registre(0x6B, 0x0F, &who_am_i, 1); // Read WHO_AM_I register
    if (who_am_i != 0xD4) {
        CDC_Transmit_FS((uint8_t *)"Gyroscope communication failed\n", 32);
    } else {
        CDC_Transmit_FS((uint8_t *)"Gyroscope initialized\n", 23);
    }
    HAL_Delay(10);
    #endif
}

/* Clear Interrupt Flags */
void Clear_Interrupts(void) {
    uint8_t dummy[6];

    #if ENABLE_MAGNETOMETER
    Beri_Registre(0x1E, 0x68, dummy, 6); // Clear magnetometer DRDY
    #endif

    #if ENABLE_ACCELEROMETER
    Beri_Registre(0x19, 0x28 | 0x80, dummy, 6); // Clear accelerometer interrupt
    #endif

    #if ENABLE_GYROSCOPE
    Beri_Registre(0x6B, 0x28 | 0x80, dummy, 6); // Clear gyroscope interrupt
    #endif
}

void pavza(){
  uint32_t counter = 0;
  for(counter=0; counter<600; counter++){
    asm("nop");
  }
}

uint8_t spi1_beriRegister(uint8_t reg)
{
  uint16_t buf_out, buf_in;
  reg |= 0x80;  // Set read bit
  buf_out = reg;
  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_3, GPIO_PIN_RESET);  // CS low
  pavza();
  HAL_SPI_TransmitReceive(&hspi1, &((uint8_t*)&buf_out)[0], &((uint8_t*)&buf_in)[0], 1, 2);
  pavza();
  HAL_SPI_TransmitReceive(&hspi1, &((uint8_t*)&buf_out)[1], &((uint8_t*)&buf_in)[1], 1, 2);
  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_3, GPIO_PIN_SET);  // CS high
  pavza();
  return buf_in >> 8;
}

void spi1_pisiRegister(uint8_t reg, uint8_t vrednost)
{
  uint16_t buf_out;
  buf_out = reg | (vrednost<<8);
  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_3, GPIO_PIN_RESET);
  pavza();
  HAL_SPI_Transmit(&hspi1, &((uint8_t*)&buf_out)[0], 1, 2);
  pavza();
  HAL_SPI_Transmit(&hspi1, &((uint8_t*)&buf_out)[1], 1, 2);
  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_3, GPIO_PIN_SET);
  pavza();
}

void spi1_beriRegistre(uint8_t reg, uint8_t* buffer, uint8_t velikost)
{
  reg |= 0xC0;
  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_3, GPIO_PIN_RESET);
  pavza();
  HAL_SPI_Transmit(&hspi1, &reg, 1, 10);
  pavza();
  HAL_SPI_Receive(&hspi1, buffer, velikost, velikost);
  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_3, GPIO_PIN_SET);
  pavza();
}

/* I2C helper functions */
uint8_t Pisi_Register(uint8_t device, uint8_t reg, uint8_t value) {
    device <<= 1;
    return HAL_I2C_Mem_Write(&hi2c1, device, reg, I2C_MEMADD_SIZE_8BIT, &value, 1, HAL_MAX_DELAY);
}

void Beri_Registre(uint8_t device, uint8_t reg, uint8_t* data, uint8_t length) {
    if (length > 1) {
        reg |= 0x80; // Auto-increment for magnetometer
    }
    device <<= 1;
    HAL_I2C_Mem_Read(&hi2c1, device, reg, I2C_MEMADD_SIZE_8BIT, data, length, HAL_MAX_DELAY);
}

float Convert_To_Gauss(int16_t raw_value) {
    return raw_value * (50.0f / 32768.0f);
}

/* Data packing function */
void Pack_Data(uint8_t *binary_buffer, uint16_t header, int16_t x, int16_t y, int16_t z) {
    binary_buffer[0] = header & 0xFF;
    binary_buffer[1] = (header >> 8) & 0xFF;
    binary_buffer[2] = packet_number & 0xFF;
    binary_buffer[3] = (packet_number >> 8) & 0xFF;
    binary_buffer[4] = x & 0xFF;
    binary_buffer[5] = (x >> 8) & 0xFF;
    binary_buffer[6] = y & 0xFF;
    binary_buffer[7] = (y >> 8) & 0xFF;
    binary_buffer[8] = z & 0xFF;
    binary_buffer[9] = (z >> 8) & 0xFF;
}

/* ASCII transmission function */
void Transmit_Data_ASCII(const char *sensor_label, float x, float y, float z) {
	 static uint32_t last_send_time = 0;
	 const uint32_t MIN_SEND_INTERVAL = 100;

    char ascii_buffer[BUFFER_SIZE];
    snprintf(ascii_buffer, BUFFER_SIZE, "{\"%s\":%d,\"X\":%.3f,\"Y\":%.3f,\"Z\":%.3f}",
             sensor_label, packet_number, x, y, z);
    if (transmission_mode == MODE_ASCII_UART) {
    	// Pošlji na UART
        // HAL_UART_Transmit(&huart2, (uint8_t *)ascii_buffer, strlen(ascii_buffer), HAL_MAX_DELAY);
        // pošiljanje podatkov ESP-ju
       	if (connection_established) {
			// Preveri časovni interval
			uint32_t current_time = HAL_GetTick();
			if (current_time - last_send_time >= MIN_SEND_INTERVAL) {
				Send_Data_To_Server(ascii_buffer);
				last_send_time = current_time;
			}
       	}
    } else if (transmission_mode == MODE_ASCII_CDC) {
        CDC_Transmit_FS((uint8_t *)ascii_buffer, strlen(ascii_buffer));
    }
}

#if ENABLE_MAGNETOMETER
/* Magnetometer handler */
void Handle_Magnetometer(void) {
    data_ready_mag = 0;

    int16_t raw_data[3];
    Beri_Registre(0x1E, 0x68, (uint8_t*)raw_data, 6);
    Clear_Interrupts(); // Clear interrupt flags

    if (transmission_mode == MODE_BINARY_UART || transmission_mode == MODE_BINARY_CDC) {
        uint8_t binary_buffer[10];
        Pack_Data(binary_buffer, HEADER_MAG, raw_data[0], raw_data[1], raw_data[2]);
        if (transmission_mode == MODE_BINARY_UART) {
            HAL_UART_Transmit(&huart2, binary_buffer, 10, HAL_MAX_DELAY);
        } else {
            CDC_Transmit_FS(binary_buffer, 10);
        }
    } else if (transmission_mode == MODE_ASCII_UART || transmission_mode == MODE_ASCII_CDC) {
        float x = Convert_To_Gauss(raw_data[0]);
        float y = Convert_To_Gauss(raw_data[1]);
        float z = Convert_To_Gauss(raw_data[2]);
        Transmit_Data_ASCII("MAG", x, y, z);
    }
    packet_number++;
}
#endif

#if ENABLE_ACCELEROMETER
/* Accelerometer handler */
void Handle_Accelerometer(void) {
    data_ready_acc = 0;

    int16_t raw_data[3];
    Beri_Registre(0x19, 0x28 | 0x80, (uint8_t*)raw_data, 6);
    Clear_Interrupts(); // Clear interrupt flags

    if (transmission_mode == MODE_BINARY_UART || transmission_mode == MODE_BINARY_CDC) {
        uint8_t binary_buffer[10];
        Pack_Data(binary_buffer, HEADER_ACC, raw_data[0], raw_data[1], raw_data[2]);
        if (transmission_mode == MODE_BINARY_UART) {
            HAL_UART_Transmit(&huart2, binary_buffer, 10, HAL_MAX_DELAY);
        } else {
            CDC_Transmit_FS(binary_buffer, 10);
        }
    } else if (transmission_mode == MODE_ASCII_UART || transmission_mode == MODE_ASCII_CDC) {
        float x = raw_data[0] * (4.0f / 32768.0f);
        float y = raw_data[1] * (4.0f / 32768.0f);
        float z = raw_data[2] * (4.0f / 32768.0f);
        Transmit_Data_ASCII("ACC", x, y, z);
    }
    packet_number++;
}
#endif

#if ENABLE_GYROSCOPE
void Handle_Gyroscope(void) {
    data_ready_gyr = 0;

    int16_t raw_data[3];
    spi1_beriRegistre(0x28 | 0x80, (uint8_t*)raw_data, 6);
    Clear_Interrupts();

    if (transmission_mode == MODE_BINARY_UART || transmission_mode == MODE_BINARY_CDC) {
        uint8_t binary_buffer[10];
        Pack_Data(binary_buffer, HEADER_GYR, raw_data[0], raw_data[1], raw_data[2]);
        if (transmission_mode == MODE_BINARY_UART) {
            HAL_UART_Transmit(&huart2, binary_buffer, 10, HAL_MAX_DELAY);
        } else {
            CDC_Transmit_FS(binary_buffer, 10);
        }
    } else if (transmission_mode == MODE_ASCII_UART || transmission_mode == MODE_ASCII_CDC) {
        float x = raw_data[0] * (500.0f / 32768.0f);
        float y = raw_data[1] * (500.0f / 32768.0f);
        float z = raw_data[2] * (500.0f / 32768.0f);
        Transmit_Data_ASCII("GYR", x, y, z);
    }
    packet_number++;
}
#endif

void Change_Response_Status(uint8_t new_status) {
	if (new_status < 0 || new_status > 5) {
/*#ifdef DEBUG
	    CDC_Transmit_FS((uint8_t *)"new_status is invalid...\r\n", 26);
	    HAL_Delay(10);
#endif*/
	    return;
	}
	has_response_changed = 1;
	response_status = new_status;
}

void Clear_RX_Buffer() {
    HAL_UART_AbortReceive_IT(&huart2);  // Stop any ongoing reception
    memset((void*)rx_buffer, 0, RX_BUFFER_SIZE);
    rx_index = 0;
    HAL_UART_Receive_IT(&huart2, &rx_buffer[0], 1);
#ifdef DEBUG
    //CDC_Transmit_FS((uint8_t*)"Cleaned Buffer\r\n", 16);
    //HAL_Delay(10);
#endif
}

void Send_Command(const char* cmd) {
	HAL_UART_AbortReceive_IT(&huart2);
    Clear_RX_Buffer();
    tick_when_sent = HAL_GetTick();
	Change_Response_Status(WAITING);
    HAL_UART_Transmit(&huart2, (uint8_t*)cmd, strlen(cmd), HAL_MAX_DELAY);
    HAL_UART_Receive_IT(&huart2, &rx_buffer[rx_index], 1);
}

uint8_t Is_Timedout(uint32_t timeout_ms) {
	uint32_t current_tick = HAL_GetTick();

