CodeLands/nrs-projekt/stm32_modul/Core/Src/main.c
	if ((current_tick - tick_when_sent) > timeout_ms) {
	    return 1; // Timed out
	}
	return 0;
}

void Configure_ESP_As_Access_Point(void) {
    switch(setup_stage) {
        case AT_TEST: // AT Test
#ifdef DEBUG
            CDC_Transmit_FS((uint8_t *)"Sending AT Test command\r\n", 25);
            HAL_Delay(10);
#endif
            Send_Command("AT\r\n\0");
            break;

        case AT_SET_CONNECT_MODE:
#ifdef DEBUG
            CDC_Transmit_FS((uint8_t *)"Sending AT set HotSpot and Connect mode command\r\n", 49);
            HAL_Delay(10);
#endif
            Send_Command("AT+CWMODE=3\r\n\0");
            break;

        case AT_SET_MAX_CONNECTIONS:
#ifdef DEBUG
            CDC_Transmit_FS((uint8_t *)"Sending AT set max connections command\r\n", 40);
            HAL_Delay(10);
#endif
            Send_Command("AT+CIPMUX=1\r\n\0");
            break;

        case AT_START_SERVER:
#ifdef DEBUG
            CDC_Transmit_FS((uint8_t *)"Sending AT start server command\r\n", 33);
            HAL_Delay(10);
#endif
            Send_Command("AT+CIPSERVER=1,80\r\n\0");
            break;

        case AT_SEND_HTML_HEADER:
#ifdef DEBUG
            CDC_Transmit_FS((uint8_t *)"Sending HTML Header\r\n", 21);
            HAL_Delay(10);
#endif
            Send_HTML_Header();
            break;

        case AT_SEND_HTML:
#ifdef DEBUG
            CDC_Transmit_FS((uint8_t *)"Sending HTML\r\n", 14);
            HAL_Delay(10);
#endif
            Send_Command(html_page2);
            break;

        default:
#ifdef DEBUG
            CDC_Transmit_FS((uint8_t *)"That Setup Stage not implemented yet\r\n", 38);
            HAL_Delay(10);
#endif
            break;
    }
    HAL_Delay(10);
}

void Send_HTML_Header() {
    Send_Command("AT+CIPSEND=0,334\r\n");
}

void Send_Connect_Request(char *ssid, char *password) {
    char cmd[128];
    snprintf(cmd, sizeof(cmd), "AT+CWJAP=\"%s\",\"%s\"\r\n", ssid, password);
    Send_Command(cmd);
}

void Handle_Client_Request(void) {
    if (strstr((char *)rx_buffer, "GET /?ssid=")) {
        char *ssid_start = strstr((char *)rx_buffer, "ssid=") + 5;
        char *password_start = strstr((char *)rx_buffer, "password=") + 9;

        char ssid[32] = {0};
        char password[64] = {0};

        char *end_ssid = strstr(ssid_start, "&");
        if (end_ssid) {
            strncpy(ssid, ssid_start, end_ssid - ssid_start);
        } else {
            strncpy(ssid, ssid_start, sizeof(ssid) - 1);
        }

        char *end_password = strstr(password_start, " ");
        if (end_password) {
            strncpy(password, password_start, end_password - password_start);
        } else {
            strncpy(password, password_start, sizeof(password) - 1);
        }

        #ifdef DEBUG // Debug: Print extracted SSID and password
        char debug_msg[128];
        snprintf(debug_msg, sizeof(debug_msg), "SSID: %s, Password: %s\r\n", ssid, password);
        CDC_Transmit_FS((uint8_t *)debug_msg, strlen(debug_msg));
        HAL_Delay(10);
        #endif

        CDC_Transmit_FS("Sending Connect to WiFi with SSID Command\r\n", 43);
        HAL_Delay(10);

        Clear_RX_Buffer(); // Clear the buffer after handling

        Send_Connect_Request(ssid, password);
    }
}

void Log_Response_Status_Change() {
	if (response_status == TIMEOUT)
		CDC_Transmit_FS((uint8_t *)"Response status changed to: TIMEOUT\r\n\r\n", 39);
	else if (response_status == SUCCESS)
		CDC_Transmit_FS((uint8_t *)"Response status changed to: SUCCESS\r\n", 37);
	else if (response_status == ERROR)
		CDC_Transmit_FS((uint8_t *)"Response status changed to: ERROR\r\n", 35);
	else if (response_status == WAITING)
		CDC_Transmit_FS((uint8_t *)"Response status changed to: WAITING\r\n", 37);
	else if (response_status == IDLE)
		CDC_Transmit_FS((uint8_t *)"Response status changed to: IDLE\r\n\r\n", 36);

    HAL_Delay(10);
}

uint8_t Has_Response_Finished(){
#ifdef DEBUG
	if (has_response_changed == 1){
		Log_Response_Status_Change();
		has_response_changed = 0;
	}
#endif
	if (response_status >= TIMEOUT && response_status < WAITING) {
		return 1;
	}
	return 0;
}

void Log_Setup_Stage_Change() {
	if (setup_stage == AT_TEST)
		CDC_Transmit_FS((uint8_t *)"Setup stage changed to: AT_TEST\r\n", 33);
	else if (setup_stage == AT_SET_CONNECT_MODE)
		CDC_Transmit_FS((uint8_t *)"Setup stage changed to: AT_SET_CONNECT_MODE\r\n", 45);
	else if (response_status == AT_SET_MAX_CONNECTIONS)
		CDC_Transmit_FS((uint8_t *)"Setup stage changed to: AT_SET_MAX_CONNECTIONS\r\n", 48);
	else if (response_status == AT_START_SERVER)
		CDC_Transmit_FS((uint8_t *)"Setup stage changed to: AT_START_SERVER\r\n", 41);
	else if (response_status == AT_SEND_HTML_HEADER)
		CDC_Transmit_FS((uint8_t *)"Setup stage changed to: AT_SEND_HTML_HEADER\r\n", 45);
	else if (response_status == AT_SEND_HTML)
		CDC_Transmit_FS((uint8_t *)"Setup stage changed to: AT_SEND_HTML\r\n", 38);
	else if (response_status == AT_SEND_CONNECT_REQUEST)
		CDC_Transmit_FS((uint8_t *)"Setup stage changed to: AT_SEND_CONNECT_REQUEST\r\n", 49);

    HAL_Delay(10);
}

void Set_Setup_Stage(uint8_t new_stage) {
	if (new_stage < 0 || new_stage > 6) {
#ifdef DEBUG
	    CDC_Transmit_FS((uint8_t *)"new_stage is invalid...\r\n", 25);
	    HAL_Delay(10);
#endif
	    return;
	}
	setup_stage = new_stage;
#ifdef DEBUG
	Log_Setup_Stage_Change();
#endif
}

void Log_Uart_Response() {
#ifdef DEBUG
    CDC_Transmit_FS((uint8_t *)"===ESP_RESPONSE===\r\n", 20);
    HAL_Delay(10);
    CDC_Transmit_FS((uint8_t *)rx_buffer, strlen((char *)rx_buffer));
    HAL_Delay(10);
    CDC_Transmit_FS((uint8_t *)"===ESP_RESPONSE_END===\r\n", 24);
    HAL_Delay(10);
#endif
}

void Handle_Response() {

#ifdef DEBUG
	if (response_status == SUCCESS || response_status == ERROR) {
        //Log_Uart_Response();

    	/*if (response_status == SUCCESS)
    		CDC_Transmit_FS((uint8_t *)"=ESP_RESPONSE: SUCCESS...\r\n", 27);
    	else //if (response_status == ERROR) {
    		CDC_Transmit_FS((uint8_t *)"=ESP_RESPONSE: ERROR...\r\n", 25);*/
	} else {
		CDC_Transmit_FS((uint8_t *)"=ESP_RESPONSE: TIMEOUT...\r\n", 27);

