CodeLands/nrs-projekt/stm32_modul/Core/Src/main.c
	}
	HAL_Delay(10);

#endif

    if (response_status != SUCCESS) {
        Clear_RX_Buffer();
        Change_Response_Status(IDLE);
        return;
    }

    switch(setup_stage) {
        case AT_TEST:
            Set_Setup_Stage(AT_SET_CONNECT_MODE);
            break;
        case AT_SET_CONNECT_MODE:
            Set_Setup_Stage(AT_SET_MAX_CONNECTIONS);
            break;
        case AT_SET_MAX_CONNECTIONS:
            Set_Setup_Stage(AT_START_SERVER);
            break;
        case AT_START_SERVER:
            Set_Setup_Stage(AT_SEND_HTML_HEADER);
            break;
        case AT_SEND_HTML_HEADER:
            Set_Setup_Stage(AT_SEND_HTML);
            break;
        case AT_SEND_HTML:
            Set_Setup_Stage(AT_SEND_HTML_HEADER);
            break;
        /*case AT_SEND_CONNECT_REQUEST:
            if (strstr((char *)rx_buffer, "WIFI CONNECTED")) {
                CDC_Transmit_FS((uint8_t *)"Wi-Fi Connected Successfully\r\n", 31);
            } else if (strstr((char *)rx_buffer, "WIFI DISCONNECT")) {
                CDC_Transmit_FS((uint8_t *)"Failed to Connect to Wi-Fi\r\n", 29);
            }
            Set_Setup_Stage(AT_SET_CONNECT_MODE);
            break;*/

        default:
            CDC_Transmit_FS((uint8_t *)"RESPONSE_NOT_IMPLEMENTED: Unknown Setup Stage\r\n", 47);
            HAL_Delay(10);
            break;
    }

    Clear_RX_Buffer(); // Then clear it after we’re done
    Change_Response_Status(IDLE);
}

void Log_Client_Status_Change() {
	if (was_client_connected == is_client_connected)
		return;
	was_client_connected = is_client_connected;
#ifdef DEBUG

	if (is_client_connected) {
		CDC_Transmit_FS((uint8_t *)"HTTP: Client Connected\r\n", 24);
	} else {
		CDC_Transmit_FS((uint8_t *)"HTTP: Client Disconnected\r\n", 27);
	}
        HAL_Delay(10);
#endif
}

void Log_Client_Request_Change() {
	if (was_client_requesting_page == is_client_requesting_page)
		return;
	was_client_requesting_page = is_client_requesting_page;
#ifdef DEBUG

	if (is_client_requesting_page) {
		CDC_Transmit_FS((uint8_t *)"HTTP: Client Started Requesting Page\r\n", 38);
	} else {
		CDC_Transmit_FS((uint8_t *)"HTTP: Client Stopped Requesting Page\r\n", 38);
	}
        HAL_Delay(10);
#endif
}

void Check_Reception_Completion() {
    if (strstr((char *)rx_buffer, "\r\n\r\n")) {
        // Timeout expired since the last received byte
        receiving_data = 0; // Mark that reception is complete

        #ifdef DEBUG
        CDC_Transmit_FS((uint8_t *)"===Data Reception Complete===\r\n", 31);
        HAL_Delay(10);

        char debug_info[50]; // Print buffer length and content
        snprintf(debug_info, sizeof(debug_info), "Buffer length: %d\r\n", strlen((char *)rx_buffer));
        CDC_Transmit_FS((uint8_t *)debug_info, strlen(debug_info));
        HAL_Delay(10);

        if (strlen((char *)rx_buffer) > 0) {
            Log_Uart_Response(); // Print the actual buffer content
            HAL_Delay(10);
        } else {
            CDC_Transmit_FS((uint8_t *)"<Empty Buffer>\r\n", 16);
            HAL_Delay(10);
        }

        #endif

        if (strstr((char *)rx_buffer, "GET /?ssid=")) {
            Handle_Client_Request();
        }

        if (strstr((char *)rx_buffer, "+STA_CONNECTED")) {
        	is_client_connected = 1;
        } else if (strstr((char *)rx_buffer, "+STA_DISCONNECTED")) {
        	is_client_connected = 0;
        }

        if (strstr((char *)rx_buffer, "0,CONNECT")) {
        	is_client_requesting_page = 1;
        } else if (strstr((char *)rx_buffer, "0,CLOSED")) {
            is_client_requesting_page = 0;
        }

        if (strstr((char *)rx_buffer, "OK")){
            Change_Response_Status(SUCCESS);
        } else if (strstr((char *)rx_buffer, "ERROR")){
        	Change_Response_Status(ERROR);
        }

        // Clear the buffer for the next reception
        Clear_RX_Buffer();
    }
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
    if (huart->Instance == USART2) // Check if it's USART2
    {
        // Store next byte at next position
        if (rx_index < RX_BUFFER_SIZE - 2) { // Leave room for next byte and null terminator
            rx_index++;
            rx_buffer[rx_index + 1] = '\0';  // Null terminate after current position
            HAL_UART_Receive_IT(&huart2, &rx_buffer[rx_index], 1);  // Set up next receive
        } else {
            // Buffer full - wrap around
            rx_index = 0;
            rx_buffer[1] = '\0';  // Null terminate after first position
            HAL_UART_Receive_IT(&huart2, &rx_buffer[rx_index], 1);  // Start over at beginning
        }



#ifdef DEBUG
        HAL_GPIO_TogglePin(GPIOE, LED_PIN_UART);
		//CDC_Transmit_FS((uint8_t *)rx_buffer, strlen((char *)rx_buffer));
		//HAL_Delay(10);
#endif
    }
}

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin) {
    if (GPIO_Pin == GPIO_PIN_0) { // Button press
        if (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_0) == GPIO_PIN_SET) { // Button pressed
            button_pressed = 1;
            button_press_start = HAL_GetTick();
        } else { // Button released
            button_pressed = 0;
            uint32_t press_duration = HAL_GetTick() - button_press_start;

            if (press_duration < 500) { // Short press
                button_action_type = 0;
            } else { // Long press
                button_action_type = 1;
            }
            button_action_pending = 1;
        }
    }

    #if ENABLE_MAGNETOMETER
    if (GPIO_Pin == GPIO_PIN_2) {
        data_ready_mag = 1;
#ifdef DEBUG
        HAL_GPIO_TogglePin(GPIOE, LED_PIN_MAGNET);
#endif
    }
    #endif
    #if ENABLE_ACCELEROMETER
    if (GPIO_Pin == GPIO_PIN_4) { // INT1 for accelerometer
        data_ready_acc = 1;
#ifdef DEBUG
        HAL_GPIO_TogglePin(GPIOE, LED_PIN_ACCEL);
#endif
    }
    #endif
    #if ENABLE_GYROSCOPE
    if (GPIO_Pin == GPIO_PIN_1) { // INT2 for gyroscope
        data_ready_gyr = 1;
#ifdef DEBUG
        HAL_GPIO_TogglePin(GPIOE, LED_PIN_GYRO);
#endif
    }
    #endif
}


