CodeLands/nrs-projekt/stm32_modul/Core/Src/main.c
void Establish_Connection(const char *server_ip, uint16_t port) {
    char cmd[128];

    // Zapri obstoječo povezavo, če obstaja
    Send_Command("AT+CIPCLOSE=0\r\n");
    HAL_Delay(100); // Kratek zamik za zaprtje povezave
    Clear_RX_Buffer();

    // Pošlji ukaz za vzpostavitev TCP povezave
    snprintf(cmd, sizeof(cmd), "AT+CIPSTART=0,\"TCP\",\"%s\",%d\r\n", server_ip, port);
    Send_Command(cmd);

    // Preverjaj odziv za omejen čas
    uint32_t start_time = HAL_GetTick();
    while ((HAL_GetTick() - start_time) < 5000) { // 5 sekund timeout
        if (strstr((char *)rx_buffer, "CONNECT")) {
            CDC_Transmit_FS((uint8_t *)"TCP connection established\n", 26);
            Change_Response_Status(SUCCESS);
            Clear_RX_Buffer();
            return;
        } else if (strstr((char *)rx_buffer, "ERROR") || strstr((char *)rx_buffer, "CLOSED")) {
            CDC_Transmit_FS((uint8_t *)"TCP connection failed\n", 23);
            Change_Response_Status(ERROR);
            Clear_RX_Buffer();
            return;
        }
    }

    // Če ni odgovora v določenem času
    CDC_Transmit_FS((uint8_t *)"Connection attempt timed out\n", 29);
    Change_Response_Status(TIMEOUT);
    Clear_RX_Buffer();
}

void Send_Data_To_Server(const char *json_data) {
    static uint32_t last_send_time = 0;
    const uint32_t MIN_INTERVAL = 500; // Minimum 500ms between sends
    uint32_t current_time = HAL_GetTick();

    // Check if enough time has passed since last send
    if (current_time - last_send_time < MIN_INTERVAL) {
        return;
    }

    char request[512];
    char cmd[128];
    uint32_t start_time;

    // Format HTTP POST request
    snprintf(request, sizeof(request),
             "POST /data HTTP/1.1\r\n"
             "Host: 172.20.10.11\r\n"
             "Content-Type: application/json\r\n"
             "Content-Length: %d\r\n"
             "Connection: keep-alive\r\n\r\n"
             "%s",
             strlen(json_data), json_data);

    if (strlen(request) > 512) {
        CDC_Transmit_FS((uint8_t *)"Data too large to send\n", 23);
        return;
    }

    // Add more debug output
    CDC_Transmit_FS((uint8_t *)"Checking connection status...\n", 29);

    // Check connection status
    Send_Command("AT+CIPSTATUS\r\n");
    HAL_Delay(100);

    if (strstr((char *)rx_buffer, "STATUS:4") || strstr((char *)rx_buffer, "STATUS:5")) {
        CDC_Transmit_FS((uint8_t *)"Connection lost, reconnecting...\n", 32);
        Clear_RX_Buffer();
        connection_established = 0;
        return;
    }

    Clear_RX_Buffer();
    CDC_Transmit_FS((uint8_t *)"Sending CIPSEND command...\n", 27);

    // Send CIPSEND command
    snprintf(cmd, sizeof(cmd), "AT+CIPSEND=0,%d\r\n", strlen(request));
    Send_Command(cmd);
    HAL_Delay(200);  // Wait for ESP to process command

    // Wait for '>' prompt with better debug output
    start_time = HAL_GetTick();
    uint8_t got_prompt = 0;
    uint8_t retries = 0;
    const uint8_t MAX_RETRIES = 3;

	while (retries < MAX_RETRIES) {
		while ((HAL_GetTick() - start_time) < 1000) { // Zmanjšaj timeout na 1 sekundo
			if (strstr((char *)rx_buffer, ">")) {
				got_prompt = 1;
				CDC_Transmit_FS((uint8_t *)"Received '>' prompt\n", 20);
				HAL_Delay(50);
				break;
			}
			HAL_Delay(10);
		}

		if (got_prompt) break;

		// Če nismo dobili prompta, poskusi ponovno
		retries++;
		if (retries < MAX_RETRIES) {
			CDC_Transmit_FS((uint8_t *)"Retrying CIPSEND...\n", 20);
			Clear_RX_Buffer();
			Send_Command(cmd);
			HAL_Delay(200);
			start_time = HAL_GetTick();
		}
	}

	if (!got_prompt) {
		CDC_Transmit_FS((uint8_t *)"Failed after max retries\n", 25);
		Clear_RX_Buffer();
		connection_established = 0; // Resetiraj povezavo
		return;
	}

    Clear_RX_Buffer();
    CDC_Transmit_FS((uint8_t *)"Sending data...\n", 16);

    // Send data
    HAL_UART_Transmit(&huart2, (uint8_t *)request, strlen(request), HAL_MAX_DELAY);

    // Wait for "SEND OK" with timeout
    start_time = HAL_GetTick();
    uint8_t send_ok = 0;

    while ((HAL_GetTick() - start_time) < 2000) {
        if (strstr((char *)rx_buffer, "SEND OK")) {
            send_ok = 1;
            CDC_Transmit_FS((uint8_t *)"Data sent successfully\n", 23);
            last_send_time = HAL_GetTick(); // Update last send time
            break;
        }
        HAL_Delay(10);
    }

    if (!send_ok) {
        CDC_Transmit_FS((uint8_t *)"Send timeout - Response:\n", 25);
        CDC_Transmit_FS(rx_buffer, strlen((char *)rx_buffer));
    }

    Clear_RX_Buffer();
}

void Test_HTTP_GET_Request() {
    const char *get_request = "GET / HTTP/1.1\r\nHost: 172.20.10.11\r\n\r\n";
    Send_Data_To_Server(get_request);
}


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
  /* USER CODE END 1 */
  /* MCU Configuration--------------------------------------------------------*/
  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();
  /* USER CODE BEGIN Init */
  /* USER CODE END Init */
  /* Configure the system clock */
  SystemClock_Config();
  /* USER CODE BEGIN SysInit */
  /* USER CODE END SysInit */
  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_I2C1_Init();
  MX_SPI1_Init();
  MX_USB_DEVICE_Init();
  MX_USART2_UART_Init();
  /* USER CODE BEGIN 2 */
  //HAL_Delay(2000);
  Init_All_Sensors();
  Verify_Sensors(); // Verify all sensor communication
  Clear_Interrupts(); // Clear interrupt flags
  Log_Response_Status_Change();
    rx_index = 0;
  HAL_UART_Receive_IT(&huart2, &rx_buffer[0], 1);
  /* USER CODE END 2 */
  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1) {
      Log_Client_Status_Change();
        Log_Client_Request_Change();

    Check_Reception_Completion();

      if (Has_Response_Finished() == 1) {
          Handle_Response();
      }

      if(Is_Timedout(5000) == 1 && response_status == WAITING) {
          Change_Response_Status(TIMEOUT);
      }

      if (response_status == SEND_REQUEST) {
          Configure_ESP_As_Access_Point();
      }

      if (button_action_pending) { // Handle button actions
          if (button_action_type == 0) { // Short press - send AT command
              Change_Response_Status(SEND_REQUEST);
          } else { // Long press - change transmission mode
              transmission_mode = (transmission_mode + 1) % 5;
      #ifdef DEBUG
              HAL_GPIO_TogglePin(GPIOE, LED_PIN_SEND_MODE);
      #endif
          }
          button_action_pending = 0;
      }

      if (!connection_established && transmission_mode == MODE_ASCII_UART)
	  {
		  CDC_Transmit_FS((uint8_t *)"Attempting to connect...\n", 25);
		  Establish_Connection("172.20.10.11", 5000);

		  /* Preveri status povezave */
		  if (response_status == SUCCESS)
		  {
			  CDC_Transmit_FS((uint8_t *)"Connection successful!\n", 24);
			  connection_established = 1; // Povezava vzpostavljena
		  }
		  else if (response_status == TIMEOUT || response_status == ERROR)
		  {
			  CDC_Transmit_FS((uint8_t *)"Connection failed, retrying...\n", 31);
			  HAL_Delay(1000); // Počakaj pred ponovnim poskusom
		  }
	  }

